Revit 2026 API

# WorksharingDisplaySettingsSetGraphicOverrides(String, WorksharingDisplayGraphicSettings) Method

---

Sets the graphic overrides assigned to elements owned by a particular user. The username cannot be on the list of removed usernames.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetGraphicOverrides(
	string username,
	WorksharingDisplayGraphicSettings overrides
)
```
```vb
Public Sub SetGraphicOverrides (
	username As String,
	overrides As WorksharingDisplayGraphicSettings
)
```
```cpp
public:
void SetGraphicOverrides(
	String^ username,
	WorksharingDisplayGraphicSettings^ overrides
)
```
```fsharp
member SetGraphicOverrides :
        username : string *
        overrides : WorksharingDisplayGraphicSettings -> unit
```

#### Parameters

username String
     The username of the desired user.
overrides WorksharingDisplayGraphicSettings
     The desired graphic overrides for this user.

| Exception | Condition |
| --- | --- |
| ArgumentException | The username is on the list of removed users. |
| ArgumentNullException | A non-optional argument was null |

Note that you can specify usernames which do not yet exist in the document's user table.

#### Reference

WorksharingDisplaySettings Class

SetGraphicOverrides Overload

Autodesk.Revit.DB Namespace